In [1]:
import pandas as pd

In [2]:
data = {'A':[1,1,1],'B':[2,2,2],'C':[3,3,3]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   A  B  C
0  1  2  3
1  1  2  3
2  1  2  3

In [5]:
df.rename?

In [6]:
df.rename(columns={'A':'X','B':'Y','C':'Z'})

   X  Y  Z
0  1  2  3
1  1  2  3
2  1  2  3

In [7]:
df

   A  B  C
0  1  2  3
1  1  2  3
2  1  2  3

In [8]:
df.rename(columns={'A':'X','B':'Y','C':'Z'},inplace=True)

In [9]:
df

   X  Y  Z
0  1  2  3
1  1  2  3
2  1  2  3